Revit 2024 API
TableCellStyleOverrideOptions.Italics Property
 Indicates if the italics characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool Italics { get; set; }
Visual Basic
Public Property Italics As Boolean
	Get
	Set
Visual C++
public:
property bool Italics {
	bool get ();
	void set (bool value);
}
See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace